---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.FabricationConfiguration
source: html/94b5a71c-4803-44cf-02ec-c29ba6b0120d.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.FabricationConfiguration Property

An external resource type representing an MEP fabrication configuration.

## Syntax (C#)
```csharp
public static ExternalResourceType FabricationConfiguration { get; }
```